JEB12345/SSB_Code/Motor_Driver/microchip_can_example/ce427_ecan_crosswire/firmware/src/system_config/exp16/dspic33ep512mu810/main.c
    /* normal message */
    else
    {
        message->message_type = CAN_MSG_DATA;
        message->data[0] = ( unsigned char ) ecan1msgBuf[message->buffer][3];
        message->data[1] = ( unsigned char ) ( (ecan1msgBuf[message->buffer][3] & 0xFF00) >> 8 );
        message->data[2] = ( unsigned char ) ecan1msgBuf[message->buffer][4];
        message->data[3] = ( unsigned char ) ( (ecan1msgBuf[message->buffer][4] & 0xFF00) >> 8 );
        message->data[4] = ( unsigned char ) ecan1msgBuf[message->buffer][5];
        message->data[5] = ( unsigned char ) ( (ecan1msgBuf[message->buffer][5] & 0xFF00) >> 8 );
        message->data[6] = ( unsigned char ) ecan1msgBuf[message->buffer][6];
        message->data[7] = ( unsigned char ) ( (ecan1msgBuf[message->buffer][6] & 0xFF00) >> 8 );
        message->data_length = ( unsigned char ) ( ecan1msgBuf[message->buffer][2] & 0x000F );
    }
}

/******************************************************************************
 * Function:        void RxECAN2(mID *message)
 *
 * PreCondition:    None
 *
 * Input:          *message: a pointer to the message structure in RAM
 *                  that will store the message.
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Moves the message from the DMA memory to RAM.
 *****************************************************************************/
void RxECAN2( mID *message )
{
    unsigned int    ide = 0;
    unsigned int    srr = 0;
    unsigned long   id = 0;

    /*
    Standard Message Format: 
    Word0 : 0bUUUx xxxx xxxx xxxx
                 |____________|||
                     SID10:0   SRR IDE(bit 0)     
    Word1 : 0bUUUU xxxx xxxx xxxx
                      |____________|
                        EID17:6
    Word2 : 0bxxxx xxx0 UUU0 xxxx
              |_____||         |__|
              EID5:0 RTR         DLC
    word3-word6: data bytes
    word7: filter hit code bits
    
    Substitute Remote Request Bit
    SRR->    "0"     Normal Message 
            "1"  Message will request remote transmission
    
    Extended  Identifier Bit            
    IDE->     "0"  Message will transmit standard identifier
               "1"  Message will transmit extended identifier
    
    Remote Transmission Request Bit
    RTR->     "0"  Message transmitted is a normal message
            "1"  Message transmitted is a remote message
    */
    /* read word 0 to see the message type */
    ide = ecan2msgBuf[message->buffer][0] & 0x0001;
    srr = ecan2msgBuf[message->buffer][0] & 0x0002;

    /* check to see what type of message it is */
    /* message is standard identifier */
    if( ide == 0 )
    {
        message->id = ( ecan2msgBuf[message->buffer][0] & 0x1FFC ) >> 2;
        message->frame_type = CAN_FRAME_STD;
    }

    /* mesage is extended identifier */
    else
    {
        id = ecan2msgBuf[message->buffer][0] & 0x1FFC;
        message->id = id << 16;
        id = ecan2msgBuf[message->buffer][1] & 0x0FFF;
        message->id = message->id + ( id << 6 );
        id = ( ecan2msgBuf[message->buffer][2] & 0xFC00 ) >> 10;
        message->id = message->id + id;
        message->frame_type = CAN_FRAME_EXT;
    }

    /* check to see what type of message it is */
    /* RTR message */
    if( srr == 1 )
    {
        message->message_type = CAN_MSG_RTR;
    }

    /* normal message */
    else
    {
        message->message_type = CAN_MSG_DATA;
        message->data[0] = ( unsigned char ) ecan2msgBuf[message->buffer][3];
        message->data[1] = ( unsigned char ) ( (ecan2msgBuf[message->buffer][3] & 0xFF00) >> 8 );
        message->data[2] = ( unsigned char ) ecan2msgBuf[message->buffer][4];
        message->data[3] = ( unsigned char ) ( (ecan2msgBuf[message->buffer][4] & 0xFF00) >> 8 );
        message->data[4] = ( unsigned char ) ecan2msgBuf[message->buffer][5];
        message->data[5] = ( unsigned char ) ( (ecan2msgBuf[message->buffer][5] & 0xFF00) >> 8 );
        message->data[6] = ( unsigned char ) ecan2msgBuf[message->buffer][6];
        message->data[7] = ( unsigned char ) ( (ecan2msgBuf[message->buffer][6] & 0xFF00) >> 8 );
        message->data_length = ( unsigned char ) ( ecan2msgBuf[message->buffer][2] & 0x000F );
    }
}

/******************************************************************************
 * Function:        void ClearIntrflags(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:         Clears all the interrupt flag registers.
 *****************************************************************************/
void ClearIntrflags( void )
{
    /* Clear Interrupt Flags */
    IFS0 = 0;
    IFS1 = 0;
    IFS2 = 0;
    IFS3 = 0;
    IFS4 = 0;
}

/******************************************************************************
 * Function:        void OscConfig(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:       This function configures the Oscillator to work at 60MHz.
 *****************************************************************************/
void OscConfig( void )
{
    /*  Configure Oscillator to operate the device at 60Mhz
     Fosc= Fin*M/(N1*N2), Fcy=Fosc/2
     Fosc= 8M*60/(2*2)=120Mhz for 8M input clock */
    PLLFBD = 58;                                /* M=60 */
    CLKDIVbits.PLLPOST = 0;                     /* N1=2 */
    CLKDIVbits.PLLPRE = 0;                      /* N2=2 */
    OSCTUN = 0;                                 /* Tune FRC oscillator, if FRC is used */

    /* Disable Watch Dog Timer */
    RCONbits.SWDTEN = 0;

    /* Clock switch to incorporate PLL*/
    __builtin_write_OSCCONH( 0x03 );            // Initiate Clock Switch to Primary

    // Oscillator with PLL (NOSC=0b011)
    __builtin_write_OSCCONL( OSCCON || 0x01 );  // Start clock switching
    while( OSCCONbits.COSC != 0b011 );

